Revit 2027 API
BuiltInFailures.GeometryFailures.SiteInvisible Property
 Topographic elements are not visible in your current view. You can modify View Range settings in the view's Properties or Visibility settings in Visibility/Graphics.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SiteInvisible { get; }
Public Shared ReadOnly Property SiteInvisible As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SiteInvisible {
	FailureDefinitionId^ get ();
}
static member SiteInvisible : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace